{
  "c": "Is responsible for antioxidant protection and supporting the immune system. Commonly found in citrus fruits and bell peppers, it also plays a key role in collagen production for skin health.",
  "b1": "Essential for energy metabolism and proper nerve function. Common sources include whole grains and pork. A deficiency can lead to beriberi, affecting the nervous system.",
  "b2": "Is responsible for cell growth and energy production. Commonly found in dairy products and eggs. It also aids in red blood cell production and eye health.",
  "b3": "Aids in digestion and promotes healthy skin. Found in meat and peanuts, it can also help lower bad cholesterol levels.",
  "b5": "Involved in hormone production and metabolism. Sources include chicken and avocado. It's important for stress and adrenal gland function.",
  "b6": "Crucial for brain development and function. Commonly found in fish and bananas, it also helps the body convert food into usable energy.",
  "b7": "Known for supporting hair, skin, and nails. Common sources include eggs and nuts. It's often included in beauty products for these benefits.",
  "b9": "Important for DNA synthesis and cell division. Found in leafy greens, it is particularly crucial during pregnancy to prevent neural tube defects.",
  "b12": "Essential for nerve function and red blood cell formation. Predominantly found in animal products, making it crucial for vegetarians to supplement.",
  "a": "Primarily focused on vision and immune system support. Found in carrots and sweet potatoes, it is essential for night vision and skin health.",
  "d": "Vital for bone health and calcium absorption. Obtained from fish or sunlight exposure, it also helps to fight off diseases like osteoporosis.",
  "e": "Acts as an antioxidant and supports skin health. Common sources include almonds and spinach. It protects cell membranes from damage.",
  "k": "Necessary for blood clotting and bone health. Found in foods like kale and spinach, it is important for wound healing and preventing osteoporosis."
}
